In [1]:
import pandas as pd
import numpy as np
import os
from env import get_db_url
import wrangle

In [2]:
def get_zillow_data():
    '''Returns a dataframe of all single family residential properties from 2017.'''
    filename = "zillow.csv"

    if os.path.isfile(filename):
        return pd.read_csv(filename)
    else:
        sql_query = '''
        SELECT properties_2017.bedroomcnt AS Number_of_Bedrooms,
        properties_2017.bathroomcnt AS Number_of_Bathrooms,
        properties_2017.calculatedfinishedsquarefeet AS Square_Footage, 
        properties_2017.taxvaluedollarcnt AS Tax_Appraised_Value, 
        properties_2017.yearbuilt AS Year_Built, 
        properties_2017.taxamount AS Tax_Assessed, properties_2017.fips
        FROM properties_2017
        JOIN propertylandusetype using (propertylandusetypeid)
        WHERE propertylandusedesc = "Single Family Residential";
        '''
        df = pd.read_sql(sql_query, get_db_url('zillow'))
        df.to_csv(filename)
    return df

In [3]:
df = get_zillow_data()
df.head()

,Unnamed: 0,Number_of_Bedrooms,Number_of_Bathrooms,Square_Footage,Tax_Appraised_Value,Year_Built,Tax_Assessed,fips
0,0,0.0,0.0,NaN,27516.0,NaN,NaN,6037.0
1,1,0.0,0.0,NaN,10.0,NaN,NaN,6037.0
2,2,0.0,0.0,NaN,10.0,NaN,NaN,6037.0
3,3,0.0,0.0,NaN,2108.0,NaN,174.21,6037.0
4,4,4.0,2.0,3633.0,296425.0,2005.0,6941.39,6037.0

In [4]:

sql_query = '''
      SELECT properties_2017.bedroomcnt AS Number_of_Bedrooms,
properties_2017.bathroomcnt AS Number_of_Bathrooms,
properties_2017.calculatedfinishedsquarefeet AS Square_Footage, 
properties_2017.taxvaluedollarcnt AS Tax_Appraised_Value, 
properties_2017.yearbuilt AS Year_Built, 
properties_2017.taxamount AS Tax_Assessed, properties_2017.fips
FROM properties_2017
JOIN propertylandusetype using (propertylandusetypeid)
WHERE propertylandusedesc = "Single Family Residential"
       '''
df = pd.read_sql(sql_query, get_db_url('zillow'))

In [5]:
df.head()

,Number_of_Bedrooms,Number_of_Bathrooms,Square_Footage,Tax_Appraised_Value,Year_Built,Tax_Assessed,fips
0,0.0,0.0,NaN,27516.0,NaN,NaN,6037.0
1,0.0,0.0,NaN,10.0,NaN,NaN,6037.0
2,0.0,0.0,NaN,10.0,NaN,NaN,6037.0
3,0.0,0.0,NaN,2108.0,NaN,174.21,6037.0
4,4.0,2.0,3633.0,296425.0,2005.0,6941.39,6037.0

In [6]:
df.shape

(2152863, 7)

In [7]:
df.isnull().mean()

Number_of_Bedrooms     0.000005
Number_of_Bathrooms    0.000005
Square_Footage         0.003941
Tax_Appraised_Value    0.000229
Year_Built             0.004337
Tax_Assessed           0.002063
fips                   0.000000
dtype: float64

In [8]:
# nulls are a small percentage of the df, good to drop them
df = df.dropna()

In [9]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
Number_of_Bedrooms,2140235.0,3.301419,0.932600,0.00,3.00,3.00,4.00,25.00
Number_of_Bathrooms,2140235.0,2.240352,0.990549,0.00,2.00,2.00,3.00,32.00
Square_Footage,2140235.0,1863.193970,1221.754161,1.00,1258.00,1623.00,2208.00,952576.00
Tax_Appraised_Value,2140235.0,460641.625164,677157.635675,22.00,189166.00,328296.00,534606.00,90188462.00
Year_Built,2140235.0,1960.967545,22.150563,1801.00,1949.00,1958.00,1976.00,2016.00
Tax_Assessed,2140235.0,5616.711322,7814.562798,6.34,2540.85,4111.47,6411.93,1078101.87
fips,2140235.0,6048.309556,20.344910,6037.00,6037.00,6037.00,6059.00,6111.00

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2140235 entries, 4 to 2152862
Data columns (total 7 columns):
 #   Column               Dtype
---  ------               -----
 0   Number_of_Bedrooms   float64
 1   Number_of_Bathrooms  float64
 2   Square_Footage       float64
 3   Tax_Appraised_Value  float64
 4   Year_Built           float64
 5   Tax_Assessed         float64
 6   fips                 float64
dtypes: float64(7)
memory usage: 130.6 MB

In [11]:
# value counts for each column
for column in df.columns:
    print(column)
    print(df[column].value_counts())
    print("-----------------")

Number_of_Bedrooms
3.0     962944
4.0     633608
2.0     334221
5.0     150671
6.0      25117
1.0      22895
7.0       4792
0.0       4397
8.0       1103
9.0        290
10.0       118
11.0        34
13.0        15
12.0        12
14.0         7
15.0         5
18.0         3
16.0         2
25.0         1
Name: Number_of_Bedrooms, dtype: int64
-----------------
Number_of_Bathrooms
2.00     942463
3.00     422398
1.00     412582
2.50     142827
4.00      82039
1.50      31157
3.50      28464
5.00      28306
4.50      19474
6.00      10717
5.50       6201
7.00       4381
0.00       4274
8.00       1681
6.50       1330
9.00        707
7.50        382
10.00       322
11.00       145
8.50        108
12.00        73
9.50         50
13.00        39
14.00        25
15.00        17
0.50         16
10.50        14
16.00        12
18.00         8
20.00         6
17.00         4
1.75          3
12.50         3
11.50         3
19.50         1
14.50         1
32.00         1
19.00         1
Name: Number_of_Bathrooms, dtype: int64
-----------------
Square_Footage
1200.0     5184
1080.0     4376
1120.0     4354
1400.0     3828
1440.0     3684
           ...
10180.0       1
13169.0       1
9095.0        1
10525.0       1
24920.0       1
Name: Square_Footage, Length: 10557, dtype: int64
-----------------
Tax_Appraised_Value
450000.0    820
500000.0    774
400000.0    723
430000.0    690
440000.0    683
           ...
729523.0      1
940139.0      1
545367.0      1
38804.0       1
536061.0      1
Name: Tax_Appraised_Value, Length: 588178, dtype: int64
-----------------
Year_Built
1955.0    84329
1950.0    71606
1954.0    69069
1953.0    62270
1956.0    61858
          ...
1855.0        1
1879.0        1
1833.0        1
1840.0        1
1874.0        1
Name: Year_Built, Length: 153, dtype: int64
-----------------
Tax_Assessed
345.72      172
344.18       76
343.52       74
49.18        46
388.18       37
           ...
8191.38       1
11627.92      1
15008.68      1
9227.22       1
13494.52      1
Name: Tax_Assessed, Length: 915868, dtype: int64
-----------------
fips
6037.0    1425207
6059.0     552057
6111.0     162971
Name: fips, dtype: int64
-----------------

In [12]:
# what should the minimum square footage be? 120 
# https://worldpopulationreview.com/state-rankings/minimum-house-size-by-state
# what percentage of homes under 120 sq ft are in the df?
round(len(df[df['Square_Footage']< 120])/ df.shape[0],4)

0.0001

In [13]:
# how many homes have no bedrooms?
len(df[df['Number_of_Bedrooms']==0])

4397

In [14]:
# bathrooms?
len(df[df['Number_of_Bathrooms']==0])

4274

In [16]:
# dropping rows that don't meet minimum home requirements

df = df.drop(df.loc[df['Square_Footage']< 120], inplace=True)
df = df.drop(df.loc[df['Number_of_Bedrooms']<1], inplace=True)
df = df.drop(df.loc[df['Number_of_Bathrooms']<.5] ,inplace=True)

AttributeError: 'NoneType' object has no attribute 'drop'

In [17]:
df.describe().T

AttributeError: 'NoneType' object has no attribute 'describe'

In [ ]:
# can a house really have 0 beds and 0 baths? 
df[(df.Number_of_Bedrooms < 1) & (df.Number_of_Bathrooms < .5)]